Repository: qopas/TUM_WEB_LAB7
Catalog: BookRental.Resources/Resources.*.resx
Languages: ro, ru

# Entity_NotFound
source: {0} with ID '{1}' was not found.
ro: {0} cu ID-ul '{1}' nu a fost găsit.
ru: {0} с идентификатором '{1}' не найден.

source: Books
ro: Cărți
ru: Книги

source: Books Management
ro: Gestionarea Cărților
ru: Управление книгами

source: Add New Book
ro: Adaugă Carte Nouă
ru: Добавить новую книгу

source: Title
ro: Titlu
ru: Название

source: Author
ro: Autor
ru: Автор

source: Publication Date
ro: Data Publicării
ru: Дата публикации

source: Available Qty
ro: Cantitate Disponibilă
ru: Доступно

source: Rental Price
ro: Preț Închiriere
ru: Цена аренды

source: Genre
ro: Gen
ru: Жанр

source: Actions
ro: Acțiuni
ru: Действия

source: Edit
ro: Editează
ru: Редактировать

source: Delete
ro: Șterge
ru: Удалить

# ConfirmDeleteBook
source: Are you sure you want to delete this book? This action cannot be undone.
ro: Sigur doriți să ștergeți această carte? Această acțiune nu poate fi anulată.
ru: Вы уверены, что хотите удалить эту книгу? Это действие нельзя отменить.

source: Book deleted successfully!
ro: Cartea a fost ștearsă cu succes!
ru: Книга успешно удалена!

source: Edit Book
ro: Editează Cartea
ru: Редактировать книгу

source: Book
ro: Carte
ru: Книга

# PleaseProvideValidTitle
source: Please provide a valid title.
ro: Vă rugăm să furnizați un titlu valid.
ru: Пожалуйста, введите корректное название.

source: Loading
ro: Se încarcă
ru: Загрузка

# PleaseSelectGenre
source: Please select a genre.
ro: Vă rugăm să selectați un gen.
ru: Пожалуйста, выберите жанр.

# PleaseProvideValidAuthor
source: Please provide a valid author name.
ro: Vă rugăm să furnizați un nume de autor valid.
ru: Пожалуйста, введите корректное имя автора.

# PleaseProvideValidPublicationDate
source: Please provide a valid publication date.
ro: Vă rugăm să furnizați o dată de publicare validă.
ru: Пожалуйста, введите корректную дату публикации.

source: Available Quantity
ro: Cantitate Disponibilă
ru: Доступное количество

# PleaseProvideValidQuantity
source: Please provide a valid quantity (0 or greater).
ro: Vă rugăm să furnizați o cantitate validă (0 sau mai mare).
ru: Пожалуйста, введите корректное количество (0 или больше).

# PleaseProvideValidPrice
source: Please provide a valid price (0 or greater).
ro: Vă rugăm să furnizați un preț valid (0 sau mai mare).
ru: Пожалуйста, введите корректную цену (0 или больше).

source: Select Genre
ro: Selectează Genul
ru: Выберите жанр

source: Error loading genres
ro: Eroare la încărcarea genurilor
ru: Ошибка загрузки жанров

source: Cancel
ro: Anulează
ru: Отмена

source: Save
ro: Salvează
ru: Сохранить

source: Saving...
ro: Se salvează...
ru: Сохранение...

source: updated successfully!
ro: actualizat cu succes!
ru: успешно обновлено!

source: created successfully!
ro: creat cu succes!
ru: успешно создано!

source: Close
ro: Închide
ru: Закрыть

source: Add New
ro: Adaugă Nou
ru: Добавить новый

source: Request failed
ro: Cererea a eșuat
ru: Запрос не удался

# FailedToLoadModal
source: Failed to load modal content
ro: Nu s-a putut încărca conținutul modalului
ru: Не удалось загрузить содержимое модального окна

# NoFormFound
source: No form found in modal content
ro: Nu s-a găsit formularul în conținutul modalului
ru: Форма не найдена в содержимом модального окна

source: Error loading form
ro: Eroare la încărcarea formularului
ru: Ошибка загрузки формы

source: Book Management
ro: Gestionarea Cărților
ru: Управление Книгами

source: Create New Book
ro: Creează Carte Nouă
ru: Создать Новую Книгу

source: Update Book
ro: Actualizează Carte
ru: Обновить Книгу

source: Delete Book
ro: Șterge Carte
ru: Удалить Книгу

source: Get Book
ro: Obține Carte
ru: Получить Книгу

source: Get All Books
ro: Obține Toate Cărțile
ru: Получить Все Книги

source: Book ID
ro: ID Carte
ru: ID Книги

source: Book Title
ro: Titlul Cărții
ru: Название Книги

source: Book Author
ro: Autorul Cărții
ru: Автор Книги

# bookPublicationDate
source: Publication Date
ro: Data Publicării
ru: Дата Публикации

# bookGenres
source: Genres
ro: Genuri
ru: Жанры

# bookAvailableQuantity
source: Available Quantity
ro: Cantitate Disponibilă
ru: Доступное Количество

# bookRentalPrice
source: Rental Price
ro: Preț Închiriere
ru: Цена Аренды

# titleRequired
source: Title is required
ro: Titlul este obligatoriu
ru: Название обязательно

# titleMaxLength
source: Title cannot exceed 200 characters
ro: Titlul nu poate depăși 200 de caractere
ru: Название не может превышать 200 символов

# authorRequired
source: Author is required
ro: Autorul este obligatoriu
ru: Автор обязателен

# authorMaxLength
source: Author cannot exceed 100 characters
ro: Autorul nu poate depăși 100 de caractere
ru: Автор не может превышать 100 символов

# publicationDateRequired
source: Publication date is required
ro: Data publicării este obligatorie
ru: Дата публикации обязательна

# publicationDateFuture
source: Publication date cannot be in the future
ro: Data publicării nu poate fi în viitor
ru: Дата публикации не может быть в будущем

# genreRequired
source: At least one genre is required
ro: Cel puțin un gen este obligatoriu
ru: Требуется хотя бы один жанр

# invalidGenreIds
source: All genre IDs must be valid GUIDs
ro: Toate ID-urile de gen trebuie să fie GUID-uri valide
ru: Все ID жанров должны быть действительными GUID

# quantityNegative
source: Available quantity cannot be negative
ro: Cantitatea disponibilă nu poate fi negativă
ru: Доступное количество не может быть отрицательным

# pricePositive
source: Rental price must be greater than zero
ro: Prețul de închiriere trebuie să fie mai mare decât zero
ru: Цена аренды должна быть больше нуля

# bookIdRequired
source: Book ID is required
ro: ID-ul cărții este obligatoriu
ru: ID книги обязателен

# idRequired
source: Id is required
ro: ID-ul este obligatoriu
ru: ID обязателен

source: Book created successfully!
ro: Cartea a fost creată cu succes!
ru: Книга успешно создана!

source: Book updated successfully!
ro: Cartea a fost actualizată cu succes!
ru: Книга успешно обновлена!

source: Book deleted successfully!
ro: Cartea a fost ștearsă cu succes!
ru: Книга успешно удалена!

source: One or more genres not found
ro: Unul sau mai multe genuri nu au fost găsite
ru: Один или несколько жанров не найдены

source: Book not found
ro: Cartea nu a fost găsită
ru: Книга не найдена

source: Error creating book
ro: Eroare la crearea cărții
ru: Ошибка при создании книги

source: Error updating book
ro: Eroare la actualizarea cărții
ru: Ошибка при обновлении книги

source: Error deleting book
ro: Eroare la ștergerea cărții
ru: Ошибка при удалении книги

source: Error loading book
ro: Eroare la încărcarea cărții
ru: Ошибка при загрузке книги
